<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# Проект «Анализ вакансий из HeadHunter»

In [2]:
import pandas as pd
import psycopg2

In [31]:
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [32]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

## 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в базе (вакансии находятся в таблице `vacancies`).

In [33]:
def get(sql_query):
    connection = psycopg2.connect(
        dbname=DBNAME,
        user=USER,
        host=HOST,
        password=PASSWORD,
        port=PORT
    )
    query = f'''{sql_query}'''
    df = pd.read_sql_query(query, connection)
    connection.close()
    return df

In [34]:
# текст запроса
query_3_1 = f'''select count(*) from vacancies
'''

In [35]:
# результат запроса

get(query_3_1)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица `employers`).

In [42]:
# текст запроса
query_3_2 = f'''select count(*) as count from employers
'''

In [43]:
# результат запроса
get(query_3_2)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0  23501

3. Посчитайте с помощью запроса количество регионов (таблица `areas`).

In [44]:
# текст запроса
# текст запроса
query_3_3 = f'''select count(*) as count from areas
'''

In [45]:
# результат запроса
get(query_3_3)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   1362

4. Посчитайте с помощью запроса количество сфер деятельности в базе (таблица `industries`).

In [46]:
# текст запроса
query_3_4 = f'''select count(*) as count from industries
'''

In [47]:
# результат запроса
get(query_3_4)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0    294

***

In [ ]:
# выводы по предварительному анализу данных

## 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (`cnt`) вакансий в каждом регионе (`area`).
Отсортируйте по количеству вакансий в порядке убывания.

In [56]:
# текст запроса

query_4_1 = f'''select count(*) as count, ar.name from vacancies left join areas ar on vacancies.area_id = ar.id group by ar.name order by count desc
'''

In [57]:
# результат запроса
get(query_4_1)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

     count             name
0     5333           Москва
1     2851  Санкт-Петербург
2     2112            Минск
3     2006      Новосибирск
4     1892           Алматы
..     ...              ...
764      1       Тарко-Сале
765      1    Новоаннинский
766      1            Бирск
767      1           Сасово
768      1             Анна

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [58]:
# текст запроса

query_4_2 = f'''select count(*) as count
                from vacancies
                where salary_from is not null
                or salary_to is not null
'''

In [59]:
# результат запроса
get(query_4_2)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до **целого числа**.

In [60]:
# текст запроса

query_4_3 = f'''with distinct_vacancies as (
        select distinct id, salary_from, salary_to
        from vacancies
        where salary_from is not null
           or salary_to   is not null
    )
    select round(avg(salary_from)) as avg_salary_from,
           round(avg(salary_to))   as avg_salary_to
    from distinct_vacancies
'''

In [61]:
# результат запроса
get(query_4_3)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   avg_salary_from  avg_salary_to
0          71065.0       110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (`schedule`) и типа трудоустройства (`employment`), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [65]:
# текст запроса

query_4_4 = f'''select schedule as schedule_type,
            employment as employment_type,
            count(distinct id) as vacancy_cnt
            from vacancies
            group by schedule_type, employment_type
            order by vacancy_cnt desc, schedule_type, employment_type
'''

In [66]:
# результат запроса
get(query_4_4)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

       schedule_type      employment_type  vacancy_cnt
0        Полный день     Полная занятость        35367
1   Удаленная работа     Полная занятость         7802
2      Гибкий график     Полная занятость         1593
3   Удаленная работа  Частичная занятость         1312
4     Сменный график     Полная занятость          940
5        Полный день           Стажировка          569
6     Вахтовый метод     Полная занятость          367
7        Полный день  Частичная занятость          347
8      Гибкий график  Частичная занятость          312
9        Полный день     Проектная работа          141
10  Удаленная работа     Проектная работа          133
11     Гибкий график           Стажировка          116
12    Сменный график  Частичная занятость          101
13  Удаленная работа           Стажировка           64
14     Гибкий график     Проектная работа           18
15    Сменный график           Стажировка           12
16    Вахтовый метод     Проектная работа            2
17    Сменный график     Проектная работа            1

5. Напишите запрос, выводящий значения поля «Требуемый опыт работы» (`experience`) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [67]:
# текст запроса

query_4_5 = f'''select experience,
            count(*) as cnt
            from vacancies
            group by experience
            order by cnt asc, experience
'''

In [68]:
# результат запроса
get(query_4_5)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           experience    cnt
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [ ]:
# выводы по детальному анализу вакансий

## 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [86]:
# текст запроса

query_5_1 = f'''with employer_cnt as (
                select emp.id,
                emp.name,
                count(vac.*) as vac_cnt,
                dense_rank() over (order by count(vac.*) desc) as vac_rank
                from employers emp
                join vacancies vac
                on vac.employer_id = emp.id
                group by emp.id, emp.name
            )
            select id, name, vac_cnt, vac_rank
            from employer_cnt
            where vac_rank in (1, 5)
            order by vac_rank, name
'''

In [76]:
# результат запроса
get(query_5_1)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

      id           name  vac_cnt  vac_rank
0   1740         Яндекс     1933         1
1  39305  Газпром нефть      331         5

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [84]:
# текст запроса

query_5_2 = f'''select ar.name,
                count(vac.*) as vac_cnt,
                count(emp.*) as emp_cnt
                from areas ar
                left join vacancies vac
                on ar.id = vac.area_id
                left join employers emp
                on ar.id = emp.area
                where vac.id is null
                group by ar.name
                order by emp_cnt desc
                limit 1
'''

In [85]:
# результат запроса
get(query_5_2)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

     name  vac_cnt  emp_cnt
0  Россия        0      410

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [91]:
# текст запроса
# текст запроса

query_5_3 = f'''select emp.name,
                count(ar.*) as ar_cnt
                from vacancies vac
                left join areas ar
                on ar.id = vac.area_id
                left join employers emp
                on vac.employer_id = emp.id
                group by emp.name
                order by ar_cnt desc
'''

In [92]:
# результат запроса
get(query_5_3)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

                         name  ar_cnt
0                      Яндекс    1933
1                  Ростелеком     491
2                    Тинькофф     444
3                        СБЕР     428
4               Газпром нефть     331
...                       ...     ...
14761            им. Тьюринга       1
14762        LLC Novalab Tech       1
14763   Компания Мир упаковки       1
14764  Лифинцев Олег Иванович       1
14765      ТрансЭнергоХолдинг       1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [110]:
# текст запроса

query_5_4 = f'''SELECT COUNT(*) AS employers_without_industry
                FROM employers e
                LEFT JOIN employers_industries ei
                ON ei.employer_id = e.id
                WHERE ei.employer_id IS NULL
'''

In [111]:
# результат запроса
get(query_5_4)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   employers_without_industry
0                        8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [112]:
# текст запроса
query_5_5 = f'''SELECT e.name
FROM employers e
JOIN employers_industries ei
    ON ei.employer_id = e.id
GROUP BY e.id, e.name
HAVING COUNT(DISTINCT ei.industry_id) = 4
ORDER BY e.name
OFFSET 2
LIMIT 1'''

In [113]:
# результат запроса
get(query_5_5)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   name
0  2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана «Разработка программного обеспечения».

In [121]:
# текст запроса
query_5_6 = f'''SELECT COUNT(DISTINCT e.id) AS employers_count
                FROM employers e
                JOIN employers_industries ei
                ON ei.employer_id = e.id
                JOIN industries i
                ON i.id = ei.industry_id
                WHERE i.name = \'Разработка программного обеспечения\''''

In [122]:
# результат запроса
get(query_5_6)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   employers_count
0             3553

7. Для компании «Яндекс» выведите список [городов-миллионников](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8), в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку "Total" с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

    Если возникнут трудности с этим заданием, посмотрите материалы модуля 6.4 «Как получать данные из веб-источников и API».

In [143]:
# код для получения списка городов-милионников
import requests
from bs4 import BeautifulSoup

# URL страницы Википедии
url = "https://ru.wikipedia.org/wiki/Города-миллионеры_России"
headers = {
    "User-Agent": "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 "
                  "(KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36"
}

# Делаем запрос к странице
response = requests.get(url, headers=headers, timeout=10)
response.raise_for_status()
# Парсим HTML
soup = BeautifulSoup(response.text, "html.parser")

# Находим таблицу со списком городов-миллионников
table = soup.find("table")

cities = []

# Итерируем строки таблицы
for row in table.find_all("tr")[1:]:
    cols = row.find_all("td")
    if cols:
        city_name = cols[1].get_text(strip=True)
        cities.append(city_name)

cities

['Москва',
 'Санкт-Петербург',
 'Новосибирск',
 'Екатеринбург',
 'Казань',
 'Красноярск',
 'Нижний Новгород',
 'Челябинск',
 'Уфа',
 'Краснодар',
 'Самара',
 'Ростов-на-Дону',
 'Омск',
 'Воронеж',
 'Пермь',
 'Волгоград']

In [155]:
# текст запроса
cities_joined = ", ".join(f"'{city}'" for city in cities)

query_5_7 = f'''WITH million_cities AS (
    SELECT id, name
    FROM areas
    WHERE name IN (
        {cities_joined}
    )
),
yandex_vacancies AS (
    SELECT mc.name AS city,
           COUNT(v.id) AS cnt
    FROM vacancies v
    JOIN employers e ON e.id = v.employer_id
    JOIN million_cities mc ON mc.id = v.area_id
    WHERE e.name = 'Яндекс'
    GROUP BY mc.name
)

SELECT city, cnt
FROM (
    SELECT city, cnt
    FROM yandex_vacancies

    UNION ALL

    SELECT 'Total' AS city, SUM(cnt) AS cnt
    FROM yandex_vacancies
) t
ORDER BY cnt ASC'''

In [156]:
get(query_5_7)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

               city    cnt
0              Омск   21.0
1         Челябинск   22.0
2        Красноярск   23.0
3         Волгоград   24.0
4             Пермь   25.0
5            Казань   25.0
6    Ростов-на-Дону   25.0
7            Самара   26.0
8               Уфа   26.0
9         Краснодар   30.0
10          Воронеж   32.0
11      Новосибирск   35.0
12  Нижний Новгород   36.0
13     Екатеринбург   39.0
14  Санкт-Петербург   42.0
15           Москва   54.0
16            Total  485.0

***

In [ ]:
# выводы по анализу работодателей

## 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

    Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова `'data'` или `'данн'`.

    *Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [157]:
# текст запроса
query_6_1 = f'''SELECT COUNT(*) AS cnt
                FROM vacancies
                WHERE name ILIKE \'%data%\'
                OR name ILIKE \'%данн%\''''

In [159]:
# результат запроса
get(query_6_1)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

    cnt
0  1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
    * 'data scientist'
    * 'data science'
    * 'исследователь данных'
    * 'ML' (здесь не нужно брать вакансии по HTML)
    * 'machine learning'
    * 'машинн%обучен%'

    **В следующих заданиях мы продолжим работать с вакансиями по этому условию.**

    Считаем вакансиями для специалистов уровня Junior следующие:
    + в названии есть слово “junior” **или**
    + требуемый опыт — «Нет опыта» **или**
    + тип трудоустройства — «Стажировка».

In [200]:
# текст запроса
ds_where =  '''WHERE
                (
                    name ILIKE '%data scientist%'
                    OR name ILIKE '%data science%'
                    OR name ILIKE '%исследователь данных%'
                    OR (
                        name ILIKE '%ml%'
                        AND name NOT ILIKE '%html%'
                    )
                    OR name ILIKE '%machine learning%'
                    OR name ILIKE '%машинн%обучен%'
                )'''
query_6_2 = f'''SELECT COUNT(*) AS cnt
FROM vacancies
    {ds_where}
    AND
    (
        name ILIKE \'%junior%\'
        OR experience = \'Нет опыта\'
        OR employment = \'Стажировка\'
    )
'''

In [201]:
# результат запроса
get(query_6_2)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   cnt
0   51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или Postgres?

    *Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [202]:
# текст запроса
query_6_3 = f'''SELECT COUNT(*) AS cnt
            FROM vacancies
            {ds_where}
            AND
            (
                key_skills ILIKE '%sql%'
                OR key_skills ILIKE '%postgres%'
            )'''

In [203]:
# результат запроса
get(query_6_3)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   cnt
0  229

4. Проверьте, насколько популярен Python в требованиях работодателей к DS. Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

    *Это можно сделать помощью запроса, аналогичного предыдущему.*

In [204]:
# текст запроса
query_6_4 = f'''SELECT COUNT(*) AS cnt
            FROM vacancies
            {ds_where}
            AND
            (
                key_skills ILIKE '%python%'
            )'''

In [205]:
# результат запроса
get(query_6_4)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   cnt
0  357

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до **двух знаков после точки-разделителя**.

In [206]:
# текст запроса
# текст запроса
query_6_4 = f'''SELECT
            ROUND(AVG(array_length(regexp_split_to_array(key_skills, ','), 1)), 2) AS avg_skills
            FROM vacancies
            {ds_where}
            AND key_skills IS NOT NULL'''

In [207]:
# результат запроса
get(query_6_4)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   avg_skills
0        1.09

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в среднем указывают для каждого типа требуемого опыта (уникальное значение из поля `experience`).

    При решении задачи примите во внимание следующее:
    1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
    2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
    3. Если в расчётах участвует `null`, в результате он тоже даст `null` (посмотрите, что возвращает запрос `select 1 + null`). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит `null` на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

    Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до **целого числа**.

In [277]:
# текст запроса
query_6_5 = f'''SELECT experience,
             ROUND(
                AVG(case
                when
                    salary_from is not null and salary_to is not null then
                        (salary_from + salary_to) / 2
                else COALESCE(salary_from, 0) + COALESCE(salary_to, 0)
                end)) AS avg_salary
            FROM vacancies
            {ds_where}
            AND (salary_from IS NOT NULL OR salary_to IS NOT NULL)
            GROUP BY experience'''

In [278]:
# результат запроса
get(query_6_5)

/var/folders/gt/8qzkfx097qv5qd1wscjc0rph0000gn/T/ipykernel_83431/156686185.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           experience  avg_salary
0         Более 6 лет    157933.0
1           Нет опыта     74643.0
2  От 1 года до 3 лет    144233.0
3       От 3 до 6 лет    256454.0

***

In [ ]:
# выводы по предметному анализу

## Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования